<!-- dflook/terraform-github-actions {"workspace":"multi-arch-base","backend_type":"remote","plan_modifier":"9ebdcefa28ba58bd0b2d6fc795d575dba5541517ae08f41ba0945779d06b671e","backend":"5f89d70d375d60850dcaf4a7045373c327793701b9370b8b980983c229644a48","plan_job_ref":"Job Test plan target and replace #324 at https://github.com/dflook/terraform-github-actions/actions/runs/4336662943","plan_hash":"b979fc065a8f00bacb4bc49c067c5f2641efb7ea3a46ee0353afc568f371fda5","plan_text_format":"text","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__ in the __multi-arch-base__ workspace
Targeting resources: `random_string.foreach["hello"]`
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 1 to add, 0 to change, 1 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ foreach = "3u3hiqFlWS" -> (known after apply)
╷
│ Warning: Resource targeting is in effect
│ 
│ You are creating a plan with the -target option, which means that the
│ result of this plan may not represent all of the changes requested by the
│ current configuration.
│ 		
│ The -target option is not for routine use, and is provided only for
│ exceptional situations such as recovering from errors or mistakes, or when
│ Terraform specifically suggests to use it as part of an error message.
╵
```
</details>

:memo: Plan generated in [Test plan target and replace #324](https://github.com/dflook/terraform-github-actions/actions/runs/4336662943)